l20110770-cyber/STM32_Weatherz-AT/Hardware/SI2C.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"

void SI2C_W_SCL(uint8_t BitValue)
{
    GPIO_WriteBit (GPIOB ,GPIO_Pin_10 ,(BitAction)BitValue);
    Delay_us(10);
}

void SI2C_W_SDA(uint8_t BitValue)
{
    GPIO_WriteBit (GPIOB,GPIO_Pin_11 ,(BitAction )BitValue);
    Delay_us(10);
}

uint8_t SI2C_R_SDA(void)
{
    uint8_t BitValue;
    BitValue =GPIO_ReadInputDataBit (GPIOB,GPIO_Pin_11);
    Delay_us(10);
    return BitValue ;
}

void SI2C_Init(void)
{
    RCC_APB2PeriphClockCmd (RCC_APB2Periph_GPIOB ,ENABLE );
    
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_OD ;
    GPIO_InitStructure.GPIO_Pin=GPIO_Pin_10 | GPIO_Pin_11 ;
    GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz ;
    GPIO_Init (GPIOB ,&GPIO_InitStructure);
    
    GPIO_SetBits (GPIOB ,GPIO_Pin_10|GPIO_Pin_11);          //释放SDA\SCL
}

void SI2C_Start(void)
{
    SI2C_W_SCL(1);
    SI2C_W_SDA(1);
    SI2C_W_SDA(0);
    SI2C_W_SCL(0);
}

void SI2C_Stop(void)
{
    SI2C_W_SDA(0);
    SI2C_W_SCL(1);
    SI2C_W_SDA(1);
}

void SI2C_SendByte(uint8_t Byte)
{
    uint8_t i;
    for(i=0;i<8;i++)
    {
        SI2C_W_SDA (Byte&(0x80>>i));
        SI2C_W_SCL (1);
        SI2C_W_SCL (0);
    }
}

uint8_t SI2C_ReceiveByte(void)
{
    uint8_t i,Byte=0x00;
    SI2C_W_SDA(1);
    
    for(i=0;i<8;i++)
    {
        SI2C_W_SCL(1);
        if(SI2C_R_SDA ()){Byte|=(0x80>>i);}
        SI2C_W_SCL(0);
    }
    return Byte;
}

void SI2C_SendAck(uint8_t AckBit)
{
    SI2C_W_SDA (AckBit);
    SI2C_W_SCL(1);
    SI2C_W_SCL(0);
}

uint8_t SI2C_ReceiveAck(void)
{
    uint8_t AckBit;
    
    SI2C_W_SDA(1);
    SI2C_W_SCL(1);
    AckBit=SI2C_R_SDA();
    SI2C_W_SCL(0);
    
    return AckBit;
}
